/***********************************************************************************
* Задача 9: Напишите программу, которая выводит случайное число из отрезка [10, 99]* 
* и показывает наибольшую цифру числа.                                             *         
************************************************************************************/

int number = new Random().Next(10, 100);

Console.Write($"{number} -> ");

int digit1 = number / 10;
int digit2 = number % 10;

Console.WriteLine("max digit: {0}", digit1 > digit2 ? digit1 : digit2);